import fs from 'fs'
import fetch from 'node-fetch'
import { xpRange } from '../lib/levelling.js'
const { levelling } = '../lib/levelling.js'
import PhoneNumber from 'awesome-phonenumber'
import { promises } from 'fs'
import { join } from 'path'
let handler = async (m, { conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems }) => {
try {
let vn = './Menu.png'
let pp = imagen4
let img = await(await fetch('https://telegra.ph/.')).buffer()
let d = new Date(new Date + 3600000)
let locale = 'ar'
let week = d.toLocaleDateString(locale, { weekday: 'long' })
let date = d.toLocaleDateString(locale, { day: 'numeric', month: 'long', year: 'numeric' })
let _uptime = process.uptime() * 1000
let uptime = clockString(_uptime)
let user = global.db.data.users[m.sender]
let { money, joincount } = global.db.data.users[m.sender]
let { exp, limit, level, role } = global.db.data.users[m.sender]
let { min, xp, max } = xpRange(level, global.multiplier)
let rtotalreg = Object.values(global.db.data.users).filter(user => user.registered == true).length 
let more = String.fromCharCode(8206)
let readMore = more.repeat(850)   
let taguser = '@' + m.sender.split("@s.whatsapp.net")[0]
let str = `
◞🏮بِسۡمِ ٱللَّهِ ٱلرَّحۡمَٰنِ ٱلرَّحِيم🏮◜
✯≼══━━﹂🔮﹁━━══≽✯
◞{إِنَّمَا ٱلتَّوۡبَةُ عَلَى ٱللَّهِ لِلَّذِينَ يَعۡمَلُونَ ٱلسُّوٓءَ بِجَهَٰلَةٖ ثُمَّ يَتُوبُونَ مِن قَرِيبٖ فَأُوْلَٰٓئِكَ يَتُوبُ ٱللَّهُ عَلَيۡهِمۡۗ وَكَانَ ٱللَّهُ عَلِيمًا حَكِيمٗا}◜
✯≼══━━﹂⛩️﹁━━══≽✯
🔮اهلا وسهلا يا《 ${taguser} 》
🔮اسم البوت《 sung jinwoo 》
🔮اسم المطور《 abdo emad 》
🔮عدد المستخدمين《 ${rtotalreg} 》
🔮وقت التشغيل《 ${uptime} 》
🔮التوقيت《 ${date} 》
🔮الاصدار《v.1 》

┓━💼 مـعلـومـات المستخدم:_ 💼━┏
┃ 💎الماس: ${limit}
┃ 👾عملات: ${money}
┃ 🪙الرموز: ${joincount}
┃ 🎟️مميز: ${user.premiumTime > 0 ? '✅' : (isPrems ? '✅' : '❌') || ''}
┃ 🎖️ مستوى* ${level}
┃ 🧰 خبرة ${exp}*
┃ ⚓ الدور ${role}*
┛━━━━━━━━━━━━━┗
◞🔮 مـلاحـظـة 🛑 ◈◜
◞🔮 يـجـب عـلـيـك كـتـابـة نـقـطـة قـبـل كـل أمـر مـثـل ⇠ 『 .اوامر 』◈◜
✯≼══━━﹂🔮﹁━━══≽✯

يرجى الإبلاغ عن أي مشكلة تواجهك وسنعمل على حلها في أقرب وقت ممكن❤️ او استخدم امر رساله-للمطور

*قسم الديني🕋*
1. [.قرآن] - يجيبك بآية قرآنية.
2. [.الله] - أسماء الله الحسنى (اختار رقم الاسم والبوت سيظهره ومعناه).
3. [.اذكار الصـباح] - أذكار الصـباح كاملة.
4. [.اذكار المـساء] - أذكار المساء كاملة.
5. [.احاديث] - أحاديث نبوية.
6. [.دين] -  أسئلة دينية.  (مش شغال)
7. [.ايه] - يجييبلك ايت الكرسي.

*قسم الجروبات👥*
1. [.الجروب] - معلومات الجروب.
2. [.الاشباح] - الأعضاء غير المتفاعلين في الجروب.
3. [.حذف] - حذف رسالة محددة.
4. [.تحذير] - تحذير شخص (3 تحذيرات وبعدها طرد).
5. [.شيل-التحذير] - إزالة التحذير.
6. [.طرد] - طرد شخص محدد.
7. [.منشن] - منشن لجميع الأعضاء.
8. [.منشني] - منشن لك.
9. [.المشرفين] - قائمة مشرفي الجروب.
10. [.خفض] - خفض رتبة أدمن.
11. [.رفع] - رفع شخص إلى أدمن.
12. [.لينك] - جلب رابط الجروب.
13. [.اعاده] - تغيير رابط الجروب.
14. [.اختفاء] - إخفاء وجودك أونلاين من البوت (للإلغاء [.افك]).
15. [.توب] - عرض توب الجروب.
26. [.تغيرالترحيب] - تغيير رسالة الترحيب.]
27. [.تغيرالمغادره] - تغيير رسالة المغادر]
28. [.ترقيه] - رفع احد مشرف 
29. [.لينك] - يظهرلك لينك الجروب.
30. [.ريستارت] - يغير رابط دعوت الجروب.
31. [.ازالت المشرف] - يزبل احد المشرفين من الاشراف.
32. [.شيل-تحذير] - يزيل تحذير من شخص.
33. [.حذف] - يحذف رسالة محددة.
34. [.دعوه] - دعوت شخص الي الجروب.
35. [.جروب فتح او قفل] 
36. [.تصويت]
37. [.المتصلين] - يظهر لك قائمة المتصلين بالنت.
38. [.استماره] 
39. [.استماره2] 
40. [.تسجيل] يسجل اسمك وعمرك في البوت.
41. [.تشغيل او تعطيل] - تشغيل او تعطيل الميزات.
42. [.وقت] - فتح اوقفل الجروب باوقات.
43. [.الصلاه] - يجبلك اوقات الصلاه في بلدك.

*قسم الرفاهية🕹️
1. [.اكس] - لعبة إكس أو.
2. [.اسألة] - تحدي أسئلة.
3. [.رياضيات] - تحديات رياضية.
4. [.صراحه] - أسئلة صراحة.
5. [.تحدي] - تحدي شخص في لعبة.
6. [.العب] - حجرة ورقة مقص ضد البوت.
7. [.حظ] - لعبة حظ.
8. [.الكلمات] - تجميع الحروف.
9. [.لو] - لعبة لو.
10. [.ذكاء] - تخمين ذكائك.
11. [.غباء] - تخمين غبائك.
12. [.الحب] - تخمين نسبة الحب.
13. [.القدوه] - تخمين قدوتك.
14. [.سؤال] - أسئلة عشوائية.
15. [.ميمز] - عرض ميمز.
16. [.ميمز انمي] - ميمز أنمي.
17. [.انمي] - معلومات عن أنمي.
18. [.زواج] - زواج شخصين.
19. [.تاج]
20. [.فعاليات]
21. [.الكره]
22. [.تحدي] _ لعبت حجر ورقه مقص
23. [.جمال]
24. [.تطقيم]
25. [.شخصيه] - ييحلل شخصيتك.
26. [.الدون] - يجبلك صوره لكرستيانو.
27. [.شبهي]
28. [.ميسي] - يجيبلك صوره لميسي.
29. [.نصيحه] - نصيحة عشوائية.
30. [.عباره رومناسيه] - عبارات رومانسية.
31. [.كت] - أسماء عشوائية.
32. [.كلمات] - يجبلك لعبت الكلمات.
33. [.ايدت]
34. [.صفع]
35. [.علم] - لعبت الاعلام.
36. [.مانجا] - يجبلك اي مانغا.
37. [.النرد] - يلفلك النرد.
38. [.الرتب] يظهرلك اكتر الناس تجميعا للجواهر والاكس بي.
39. [.احزر] - لعبت احزر الشخصيه.
40. [.2احزر] - لعبت احزر الشخصيه بمستوي اصعب.
41. [.بوم] - لعبت القنبله.
42. [.فزوره]
*قسم الأدوات⚙️*
1. [.بحث] - بحث في جوجل.
2. [.ترجمه] - ترجمة لأي لغة.
3. [.تحميل] - تحميل أي ملف.
4. [.ميديافاير] - تحميل ملف من ميديافاير.
5. [.تطبيق] - نحميل اي تطبيق. 
7. [.باركود] - تحويل الرابط إلى باركود.
9. [.عميق] - تغيير الصوت إلى صوت عميق.
12. [.جيف] - تحويل الفيديو إلى GIF.
14. [.لفيديو] - تحويل الستيك إلى فيديو.
15. [.لصوت] - تحويل الفيديو إلى صوت.
16. [.سرقه] - سرقة ستيك.
17. [.زخرفه] - زخرفة النص.
18. [.انطق] - تحويل النص إلى صوت.
19. [.دمج] - دمج إيموجيين.
20. [.لريك] - تحويل الصوت إلى ريك.
21. [.تليجراف] - تحويل الملف إلى رابط.
22. [.فري بيك] - البحث عن صورة.
23. [.قطه] - صورة قطة.
24. [.بروفايلي] - ملفك الشخصي.
25. [.بنك]
26. [.لستيكر] - تحويل الصورة إلى ملصق.
27. [.اقول]
28. [.جروب فتح او قفل]
29. [.تصميم] - يعملك صوره فيها الي هتكتبه.
30. [.رمزي] - يظهر رقمك التسلسلي.
31. [.ويكي] - يبحث لك علي اي شيء في موقع ويكي بيديا.
32. [.الطقس]
33. [.فيك] - يعمك ايميل فيك.
34. [.بنج] - يوريك سرعت نت.
35. [.مسح] - يمسحلك خلفيت اي صوره.
36. [.3فيديو] - يجيبلك اي فيديو من اليوتيوب ويحمله لك.
37. [.2فيديو] - يجيبلك اي قناهبدون تحميل
38. [.درايف] - يحملك اي ىملف من جوجل درايف.
39. [.تطبيق] -  جلب أي تطبيق باسمه.
40. [.apk] - تحميل اي تطبيق
41. [.تيكتوك] - يحملك اي فيديو من تيكتوك.
42. [.بين] - يجبلك صوره من بينترست.
43. [.تغير-حقوق] - تغير حقوق الملصق.
44. [.جيت] - يحملك اي مشروع من جيت هاب.
45. [.جوده] - يحسنلك جودت اي صوره.
46. [.بوت] - يجيبلك الذكاء الاصطناعي لك.
47. [.لريك] - يحولك الفيديو لصوت.
48. [.وانو] - يستخدم الذكاء الاصطناعي وانو.
49. [.رفع-صوره] - يرفعلك اي صوره.
50. [.تطبيق] - يحمبك اي تطبيق.
51. [.يوتيوب4] - يحملك اي فيديو من اليوتيوب.

*قسم الاكسبي🤖*
1. [.لفل] - مستوى تفاعلك مع البوت.
2. [.الماسي] - عرض مستوى الماسي.
3. [.يومي] - جلب هدية يومية.
4. [.تعدين] - التعدين.
5. [.شراء] - شراء الماس أو اكسبي.
6. [.عمل] - سؤال مقابل اكسبي.
7. [.هجوم] - سرقة اكسبي.
8. [.رمزي] - رقمك التسلسلي.
9. [.تصليح] - إصلاح أي مشكلة تواجهك.
10. [.بنك]
11. [.الماس] - شراء الماس
12. [.راتب] 

*قسم السوشيال🗂️*
1. [.اغنيه] - جلب أغنية من اليوتيوب.
2. [.انستجرام] - بحث عن حساب على إنستجرام.
3. [.انستا] - تحميل مقطع من إنستجرام. (مش شغال)
4. [.ستوري-انستا] - تحميل ستوري من إنستجرام.
5. [.تيكتوك-صوره] - تحميل صورة من تيك توك.
6. [.تيكتوك] - تحميل فيديو من تيك توك.
7. [.يوتيوب] - بحث عن فيديو في يوتيوب.
8. [.فيس] - تحميل من فيسبوك.
9. [.رفع-صوره] - يرفعلك اي صوره او فيديو

*قسم الاكسبي⭐️*
1. [.راتب] - جلب الراتب.

*قسم التطبيقات*
1. [.تطبيق] - جلب أي تطبيق باسمه.

*قسم البوت🤖*
1. [.لفل] - مستوى تفاعلك مع البوت.
2. [.الماسي] - عرض مستوى الماسي.
3. [.يومي] - جلب هدية يومية.
4. [.تعدين] - التعدين.
5. [.شراء] - شراء الماس أو اكسبي.
6. [.عمل] - سؤال مقابل اكسبي.
7. [.هجوم] - سرقة اكسبي.
8. [.رمزي] - رقمك التسلسلي.
9. [.تصليح] - إصلاح أي مشكلة تواجهك.
10. [.بنك]
11. [.الماس] - شراء الماس

 🎤قسم الصوتيات🎤 
 1. [.عميق]

 2. [.منفوخ]

 3. [.تخين]

 4. [.صاخب]

 5. [.سريع]

 6. [.تخينن]

 7. [.رفيع]

 8. [.روبوت]

 9. [.بطيء]

 10. [.ناعم]

 11. [.سنجاب]

قسم الاوامر الانجليزي 
1. [autoai] - يخلي البوت يشغل الذكاء الاصطناعي في الشات
2. [bard] -  تستخدم الذكاء الاصطناعي بارد           
3. [gpt] - يس تخدم شات جي بي تي  
4. [logo] - يعملك لوجو
5. [tozombie] - يحولك اي صوره لزومب
6. [ytmp4] - يحملك اي فيديو من اليوتيوب
7. [threads] - تحميل الفيديو هات من منصت ثريدس
8. [storyset] - تحميل صور بجوده عاليه
9. [story] - تحميل صور بجو
10. [plp] - يحملك اي مشروع لبرنامج  بيكسلاب
11. [photoleap] - ينشئ لك صور بالذكاء الاصطناعي
12. [mp3] - يحملك اي فيديو او اغنيه من اليوتيوب صوت بس 
13. [kitab] - يحملك اي كتاب او روايه 
14. [apk] - يحملك اي تطبيق
15. [apk2] - يحملك اي تطبيق
16. [ayati] - يحملك اي ايه من القران صوت
17. [tts] - ينطق البوت الكلام الذي تكتبه
18. [zmoai] - يصنع صوره بالذكاء الاصطناعي

*قسم المطور👨🏼‍💻*
1. [.بلاغ] - التواصل مع المطور.
2. [.نشر] - نشر رسالة لجميع مستخدمي البوت.
3. [.جروبات] - جلب جميع الجروبات التي بداخلها البوت.
4. [.بريم] - تمييز شخص.
5. [.خفض-التميير] - خفض تمييز شخص.
6. [.المستخدين] - عدد مستخدمي البوت.
7. [.حظر | فك-حظر] - حظر أو فك حظر شات.
8. [.المحظورين] - قائمة المحظورين.
9. [.بان | فك البان] - حظر أو فك حظر مستخدم.
10. [.بلوك | رفع بلوك] - حظر أو رفع الحظر.
11. [.البلوكات] - قائمة المحظورين.
12. [.انضم] - دخول جروب.
13. [.أخرج] - خروج من جروب.
14. [.المميزين] - قائمة المميزين.
15. [.اضف-الماس] - إضافة ماس.
16. [.اضف-اكسبي] - إضافة اكسبي.
17. [.ادمن] - رفع شخص إلى أدمن في الجروب.
15. [.تغير] - يغير صورت بروفايل البوت.
16. [.وقت-التشغيل] - وقت تشغيل البوت.
16. [.رسترت-البوت] - إعادة تشغيل البوت.
17. [.البوت-خاص] - يوريك مستخدمين البوت في الخاص.
18. [.ميزه] - يجبلك اي كود من اكواد البوت.
19. [.انضم2] - يدخل اي جروب بوقت
20. [.تمكين] - يجعل اي شخص يستخدم البوت في الخاص 
21. [.ايدي] - يجبلك ايدي اي جروب 

✯≼═══━━﹂🔮﹁━━══≽✯

👑┑━━━حـقـوق الـمـطـور━━━┍👑
🏮⇆ رقـم الـمطـور  ↯*
🏮 https://wa.me/+201150768139
👑┙━━━حـقـوق الـمـطـور━━━┕👑

✯≼══━━﹂🔮﹁━━══≽✯
البوت تابع لجروب 『』
✯≼══━━﹂🔮﹁━━══≽✯`.trim()
let buttonMessage = {
image: pp,
caption: str.trim(),
mentions: [m.sender],
footer: `${wm}`,
headerType: 4,
contextInfo: {
mentionedJid: [m.sender],
externalAdReply: {
showAdAttribution: true,
mediaType: 'VIDEO',
mediaUrl: null,
title: '『👑┇Nano┇🤖┇𝔅𝔬𝔱┇👑』',
body: null,
thumbnail: img,
}}}
conn.sendMessage(m.chat, buttonMessage, { quoted: m })
//await conn.sendFile(m.chat, vn, 'menu.mp3', null, m, true, { type: 'audioMessage', ptt: true})
} catch {
conn.reply(m.chat, '[❗INFO❗] تحتوي القائمة على خطأ ولا يمكن إرسالها، يرجى الإبلاغ عنها إلى مالك الروبوت', m)
}}
handler.command = /^(8)$/i
handler.exp = 50
handler.fail = null
export default handler
function clockString(ms) {
let h = isNaN(ms) ? '--' : Math.floor(ms / 3600000)
let m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60
let s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60
return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':')}
